In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as pt

In [2]:
df=pd.read_csv('supershops.csv')

In [3]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Checking the shape

In [5]:
df.shape

(50, 5)

In [6]:
row,column=df.shape

In [7]:
row

50

In [8]:
column

5

# Checking null value and droping

In [9]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [10]:
df=df.dropna()

In [11]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# Now copying the dataset

In [12]:
df1=df.copy()
df2=df.copy()
df3=df.copy()
df4=df.copy()

In [13]:
df1.isnull().sum()       #Just checking after copying drop is okay/not

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# Perfrom the four different methos of scaling on respectively df1 to df4
1. Normalization
2. Standardization
3. Robust Scaler
4. Max Absolute Scaler

# Start with Normalization on df1

In [14]:
df1.head(1)

   Marketing Spend  Administration  Transport   Area     Profit
0        114523.61        136897.8   471784.1  Dhaka  192261.83

In [15]:
from sklearn.preprocessing import MinMaxScaler   #Importing library
scaler=MinMaxScaler()

In [16]:
ad=scaler.fit(df1[['Marketing Spend']])  #First one in details then next two features did transform directly

In [17]:
ad

MinMaxScaler()

In [18]:
df1.head(1)

   Marketing Spend  Administration  Transport   Area     Profit
0        114523.61        136897.8   471784.1  Dhaka  192261.83

In [19]:
df1['Marketing Spend']=scaler.transform(df1[['Marketing Spend']])
df1.head(1)

   Marketing Spend  Administration  Transport   Area     Profit
0         0.692617        136897.8   471784.1  Dhaka  192261.83

In [20]:
df1['Administration']=scaler.fit_transform(df1[['Administration']])
df1['Transport']=scaler.fit_transform(df1[['Transport']])

In [32]:
df1.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# Now applying Standardization on df2:

In [22]:
from sklearn.preprocessing import StandardScaler
scaler_2 = StandardScaler()

In [23]:
df2.head(2)

   Marketing Spend  Administration  Transport   Area     Profit
0        114523.61       136897.80  471784.10  Dhaka  192261.83
1        162597.70       151377.59  443898.53    Ctg  191792.06

In [29]:
df2['Marketing Spend']=scaler_2.fit_transform(df2[['Marketing Spend']])
df2['Administration']=scaler_2.fit_transform(df2[['Administration']])
df2['Transport']=scaler_2.fit_transform(df2[['Transport']])

In [33]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.895248        0.586658   2.165287    Dhaka  192261.83
1         1.943398        1.110709   1.929843      Ctg  191792.06
2         1.743767       -0.707282   1.626191  Rangpur  191050.39
3         1.546035       -0.072973   1.417348    Dhaka  182901.99
4         1.496650       -1.060289   1.273550  Rangpur  166187.94

# Now applying Robust Scaler on df3:

In [34]:
df3.head(1)

   Marketing Spend  Administration  Transport   Area     Profit
0        114523.61        136897.8   471784.1  Dhaka  192261.83

In [35]:
from sklearn.preprocessing import RobustScaler
RS=RobustScaler()

In [38]:
# df1['Administration']=scaler.fit_transform(df[['Administration']])

df3['Marketing Spend']=RS.fit_transform(df3[['Marketing Spend']])
df3['Administration']=RS.fit_transform(df3[['Administration']])
df3['Transport']=RS.fit_transform(df3[['Transport']])

In [39]:
df3.head(1)

   Marketing Spend  Administration  Transport   Area     Profit
0         0.669502        0.347651   1.552016  Dhaka  192261.83

# Now applying Max Absolute Scaler Scaler on df4:

In [40]:
df4.head(1)

   Marketing Spend  Administration  Transport   Area     Profit
0        114523.61        136897.8   471784.1  Dhaka  192261.83

In [42]:
from sklearn.preprocessing import MaxAbsScaler
MAS = MaxAbsScaler()

In [44]:
df4['Marketing Spend']=MAS.fit_transform(df4[['Marketing Spend']])
df4['Administration']=MAS.fit_transform(df4[['Administration']])
df4['Transport']=MAS.fit_transform(df4[['Transport']])

In [45]:
df4.head(1)

   Marketing Spend  Administration  Transport   Area     Profit
0         0.692617        0.749527        1.0  Dhaka  192261.83

# Finally have a look

In [46]:
df.head(1)

   Marketing Spend  Administration  Transport   Area     Profit
0        114523.61        136897.8   471784.1  Dhaka  192261.83

In [47]:
df1.head(1)

   Marketing Spend  Administration  Transport   Area     Profit
0         0.692617        0.651744        1.0  Dhaka  192261.83

In [48]:
df2.head(1)

   Marketing Spend  Administration  Transport   Area     Profit
0         0.895248        0.586658   2.165287  Dhaka  192261.83

In [49]:
df3.head(1)

   Marketing Spend  Administration  Transport   Area     Profit
0         0.669502        0.347651   1.552016  Dhaka  192261.83

In [50]:
df4.head(1)

   Marketing Spend  Administration  Transport   Area     Profit
0         0.692617        0.749527        1.0  Dhaka  192261.83